[
  {
    "frame": "frame_1.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. A large wooden cabinet filled with artifacts is prominent on the far left wall, next to a tall stained-glass window.",
    "pov": "The camera is positioned behind and slightly to the left of the foreground character, offering a view of the room that focuses on the left-center. The grand cabinet and a stained-glass window are clearly visible on the far left, while the far right side of the room is mostly obscured.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_1.png"
  },
  {
    "frame": "frame_2.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The large wooden cabinet on the left wall remains prominent, though slightly less central. Hints of a table with a fruit bowl appear on the right side of the main seating area.",
    "pov": "The camera has shifted slightly to the right, maintaining the foreground character's position within the frame. This slight shift begins to reveal more of the mid-right section of the room, including new details like a table arrangement, while the leftmost edge starts to recede.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_2.png"
  },
  {
    "frame": "frame_3.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The cabinet on the far left is still visible but is less emphasized, as more of the room's central and right elements come into view. A large, ornate archway is becoming clearer on the middle-right wall.",
    "pov": "The camera continues its steady shift to the right, widening the view of the central and right portions of the common room. The archway on the right becomes more discernible, and the overall perspective slightly broadens towards the right side, making the left side less prominent.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_3.png"
  },
  {
    "frame": "frame_4.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The archway on the middle-right wall is now more clearly defined, showing a glimpse of stairs beyond it. The leftmost cabinet and window are now less prominent in the frame.",
    "pov": "Further panning to the right, the camera now offers a better view into the archway on the right, revealing more depth. The overall scene increasingly emphasizes the right side of the room, drawing attention away from the far left elements which are now closer to the frame's edge.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_4.png"
  },
  {
    "frame": "frame_5.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The archway on the right is now well-defined, leading into another section of the room. A group of individuals gathered around a table with a fruit bowl on the right is now more central to the mid-ground.",
    "pov": "The camera has moved further right, providing an expansive view of the right-hand side of the room. The areas beyond the right archway are more visible, showcasing additional architectural details and seating arrangements. The left-most parts of the room are now barely in frame.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_5.png"
  },
  {
    "frame": "frame_6.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The right archway fully reveals a connecting hallway or section. A large, stone fireplace structure, previously unseen, begins to appear on the far right wall of the main room.",
    "pov": "The camera has continued its rightward shift, now prominently featuring the archway and beginning to reveal the substantial stone fireplace on the far right. This viewpoint significantly expands the visible area to the right of the foreground character, minimizing the left side of the room.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_6.png"
  },
  {
    "frame": "frame_7.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The grand stone fireplace is now clearly visible on the right side of the room, adding a significant architectural feature. The left side of the room, including the cabinet, is now almost completely out of frame.",
    "pov": "The camera is now significantly to the right of its starting position, with the majestic fireplace becoming a dominant feature on the right side of the frame. This angle dramatically shifts the focus to the right half of the room, with only a narrow strip of the leftmost elements remaining visible.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_7.png"
  },
  {
    "frame": "frame_8.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The entire grand stone fireplace on the right is now in full view, complete with logs and a glowing fire within its hearth. Further details of the room's rightmost seating areas and inhabitants are revealed.",
    "pov": "This viewpoint showcases the full expanse of the magnificent fireplace on the right, providing a warm and inviting focal point. The camera's position to the far right maximizes the visibility of this section of the room, almost entirely omitting the original leftmost elements.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_8.png"
  },
  {
    "frame": "frame_9.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The prominent stone fireplace continues to dominate the right side of the room, with its intricate details and the warmth of the fire clearly visible. The overall depth and breadth of the room to the right are now fully realized.",
    "pov": "At one of its furthest right positions, the camera provides a comprehensive panorama of the right half of the common room. The fireplace and its surroundings are highly detailed, giving a sense of the room's full grandeur from this perspective.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_9.png"
  },
  {
    "frame": "frame_10.png",
    "description": "A grand, high-ceilinged common room, likely within a magical castle, featuring ornate reddish-orange wall coverings with vine motifs, and numerous framed portraits. Sunlight streams through tall arched windows on the left and back, illuminating intricate patterns on large, dark red rugs and antique wooden furniture. Several individuals are present, some engaged in conversation at tables or seated in armchairs. In the foreground, a person in a dark and red academic robe stands with their back mostly to the camera, observing the room. The impressive stone fireplace, complete with a burning fire, anchors the right side of the room. The natural light from the large windows on the far right is now more accentuated, highlighting the textures of the stone and tapestries.",
    "pov": "The camera has reached its rightmost and slightly most distant point, offering the widest possible view of the right side of the room. This final viewpoint accentuates the expansive architecture and the lively activity within this section, with the character in the foreground still maintaining their fixed position in the frame.",
    "coordinates": [
      0,
      0,
      0
    ],
    "image_filepath": "/Users/navasfarhan/repos/GetOut/playgrounds/hiddenPOVs/frames_final/frame_10.png"
  }
]